; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_12 ?v2 ?v8)
             (pred_2 ?v13 ?v1)
             (pred_10 ?v2 ?v1)
             (pred_1 ?v4 ?v2 )
	     (pred_5 ?v2)
             (pred_7 ?v12)
             (pred_4 ?v13)
             (pred_3 ?v1)
             (pred_11 ?v2)
             (pred_9 ?v13)
             (pred_8 ?v2)
             (pred_6 ))



(:action op_3
:parameters (?v9 ?v3 ?v11 ?v10)
:precondition (and (pred_7 ?v9) (pred_7 ?v3) (pred_4 ?v11) (pred_3 ?v10)
          (pred_12 ?v9 ?v3) (pred_2 ?v11 ?v10)
                   (pred_10 ?v3 ?v10) (pred_5 ?v9) 
                   (pred_11 ?v3) (pred_9 ?v11))
:effect (and  (pred_8 ?v3) (not (pred_11 ?v3))))


(:action op_5
:parameters (?v9 ?v7)
:precondition (and (pred_7 ?v9) (pred_7 ?v7)
               (pred_5 ?v9) (pred_12 ?v9 ?v7) (pred_8 ?v7))
:effect (and (pred_5 ?v7) (not (pred_5 ?v9))))

(:action op_1
:parameters (?v9 ?v11)
:precondition (and (pred_7 ?v9) (pred_4 ?v11) 
                  (pred_5 ?v9) (pred_1 ?v11 ?v9) (pred_6 ))
:effect (and (pred_9 ?v11)
   (not (pred_1 ?v11 ?v9)) (not (pred_6 ))))


(:action op_2
:parameters (?v9 ?v6 ?v5)
:precondition (and (pred_7 ?v9) (pred_4 ?v6) (pred_4 ?v5)
                  (pred_5 ?v9) (pred_9 ?v5) (pred_1 ?v6 ?v9))
:effect (and (pred_9 ?v6) (pred_1 ?v5 ?v9)
        (not (pred_9 ?v5)) (not (pred_1 ?v6 ?v9))))

(:action op_4
:parameters (?v9 ?v11)
:precondition (and (pred_7 ?v9) (pred_4 ?v11) 
                  (pred_5 ?v9) (pred_9 ?v11))
:effect (and (pred_6 ) (pred_1 ?v11 ?v9) (not (pred_9 ?v11)))))

; problem
(define (problem grid-4-4-2-2-2)
    (:domain grid)
    (:objects
    obj_08 obj_04 obj_03 obj_07 obj_14 obj_11 obj_02 obj_10 obj_18 obj_01 obj_19 obj_09 obj_15 obj_05 obj_06 obj_13
    obj_20 obj_16
    obj_12 obj_17
    )

    (:init
       (pred_6)

       (pred_7 obj_08)
       (pred_7 obj_04)
       (pred_7 obj_03)
       (pred_7 obj_07)
       (pred_7 obj_14)
       (pred_7 obj_11)
       (pred_7 obj_02)
       (pred_7 obj_10)
       (pred_7 obj_18)
       (pred_7 obj_01)
       (pred_7 obj_19)
       (pred_7 obj_09)
       (pred_7 obj_15)
       (pred_7 obj_05)
       (pred_7 obj_06)
       (pred_7 obj_13)
       (pred_3 obj_20)
       (pred_3 obj_16)
       (pred_4 obj_12)
       (pred_4 obj_17)

       (pred_12 obj_08 obj_14)
       (pred_12 obj_08 obj_04)
       (pred_12 obj_04 obj_11)
       (pred_12 obj_04 obj_03)
       (pred_12 obj_04 obj_08)
       (pred_12 obj_03 obj_02)
       (pred_12 obj_03 obj_07)
       (pred_12 obj_03 obj_04)
       (pred_12 obj_07 obj_10)
       (pred_12 obj_07 obj_03)
       (pred_12 obj_14 obj_18)
       (pred_12 obj_14 obj_11)
       (pred_12 obj_14 obj_08)
       (pred_12 obj_11 obj_01)
       (pred_12 obj_11 obj_02)
       (pred_12 obj_11 obj_04)
       (pred_12 obj_11 obj_14)
       (pred_12 obj_02 obj_19)
       (pred_12 obj_02 obj_10)
       (pred_12 obj_02 obj_03)
       (pred_12 obj_02 obj_11)
       (pred_12 obj_10 obj_09)
       (pred_12 obj_10 obj_07)
       (pred_12 obj_10 obj_02)
       (pred_12 obj_18 obj_15)
       (pred_12 obj_18 obj_01)
       (pred_12 obj_18 obj_14)
       (pred_12 obj_01 obj_05)
       (pred_12 obj_01 obj_19)
       (pred_12 obj_01 obj_11)
       (pred_12 obj_01 obj_18)
       (pred_12 obj_19 obj_06)
       (pred_12 obj_19 obj_09)
       (pred_12 obj_19 obj_02)
       (pred_12 obj_19 obj_01)
       (pred_12 obj_09 obj_13)
       (pred_12 obj_09 obj_10)
       (pred_12 obj_09 obj_19)
       (pred_12 obj_15 obj_05)
       (pred_12 obj_15 obj_18)
       (pred_12 obj_05 obj_06)
       (pred_12 obj_05 obj_01)
       (pred_12 obj_05 obj_15)
       (pred_12 obj_06 obj_13)
       (pred_12 obj_06 obj_19)
       (pred_12 obj_06 obj_05)
       (pred_12 obj_13 obj_09)
       (pred_12 obj_13 obj_06)
       (pred_11 obj_07)
       (pred_11 obj_18)
       (pred_10  obj_07 obj_20)
       (pred_10  obj_18 obj_16)
       (pred_8 obj_08)
       (pred_8 obj_04)
       (pred_8 obj_03)
       (pred_8 obj_14)
       (pred_8 obj_11)
       (pred_8 obj_02)
       (pred_8 obj_10)
       (pred_8 obj_01)
       (pred_8 obj_19)
       (pred_8 obj_09)
       (pred_8 obj_15)
       (pred_8 obj_05)
       (pred_8 obj_06)
       (pred_8 obj_13)

       (pred_2  obj_12 obj_20)
       (pred_2  obj_17 obj_16)
       (pred_1 obj_12 obj_08)
       (pred_1 obj_17 obj_11)
       (pred_5 obj_04)
    )

    (:goal (and
       (pred_1 obj_17 obj_06)
    ))
(:constraints
  (always (not (pred_5 obj_19)))
)
)

; plan
1. (op_5 obj_04 obj_11)
   deleted: (pred_5 obj_04)
   added: (pred_5 obj_11)
   goals met: 0 of 1
2. (op_1 obj_11 obj_17)
   deleted: (pred_1 obj_17 obj_11) (pred_6)
   added: (pred_9 obj_17)
   goals met: 0 of 1
3. (op_5 obj_11 obj_01)
   deleted: (pred_5 obj_11)
   added: (pred_5 obj_01)
   goals met: 0 of 1
4. (op_5 obj_01 obj_05)
   deleted: (pred_5 obj_01)
   added: (pred_5 obj_05)
   goals met: 0 of 1
5. (op_5 obj_05 obj_06)
   deleted: (pred_5 obj_05)
   added: (pred_5 obj_06)
   goals met: 0 of 1
6. (op_4 obj_06 obj_17)
   deleted: (pred_9 obj_17)
   added: (pred_6) (pred_1 obj_17 obj_06)
   goals met: 1 of 1
